# Indexing and SQLite

In [1]:
import sqlite3

In [3]:
db = sqlite3.connect('IMDB.sqlite')
db

In [4]:
# new database 

db = sqlite3.connect('School.sqlite')
db

In [5]:
# create cursor object
cur = db.cursor()
cur

In [6]:
# create new table
sql_query = 'create table Student(RollNo int Primary Key,Name Text,Age int)'

# execute this query
cur.execute(sql_query)

In [8]:
cur.execute('Insert into Student values(101,"Aman",20)')

In [9]:
# refect change int database or dbbroweser
db.commit()

In [10]:
cur.execute('Insert into Student values(102,"Akash",21)')
db.commit()

In [11]:
# close connetiom
db.close()

In [13]:
cur.execute('Insert into Student values(102,"Akash",21)')
db.commit()

ProgrammingError: Cannot operate on a closed database.

### Assignment create Employe Table

In [2]:
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()

In [3]:
cur.execute('create table EmployeeDetail(Employee_id int Primary Key, Name varchar(100), Age int, Department varchar(100), Salary int)')
db.commit()

OperationalError: table EmployeeDetail already exists

In [7]:
cur.execute('insert into EmployeeDetail values(100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"Operation",60000),(102,"Rishav",24,"Human Resource",750000)')

db.commit()

In [31]:
cur.execute('delete from EmployeeDetail where Employee_id = 101')

db.commit()

In [32]:
emp_id = 102
cur.execute('delete from EmployeeDetail where Employee_id = ?',(emp_id,))

db.commit()

In [6]:
cur.execute('delete from EmployeeDetail where Employee_id = 100')

db.commit()

In [10]:
cur.execute('select Employee_id from EmployeeDetail where Department = "Marketing"')
for i in cur:
    print(i)

(100,)

In [12]:
cur.execute('select Department,count(Employee_id) from EmployeeDetail group by Department')
for i in cur:
    print(i)

('Human Resource', 1)
('Marketing', 1)
('Operation', 1)

#### ma'am

In [33]:
db = sqlite3.connect('School.sqlite')
cur = db.cursor()

In [36]:
cur.execute('Insert into Student values(103,"Abid",21)')
db.commit()

OperationalError: database is locked

In [28]:
# passing variable to query
roll = 105
name = "Achyut"
age = 20
cur.execute('Insert into Student values(?,?,?)',(roll,name,age))
db.commit()

OperationalError: database is locked

In [4]:
values = [(105,"Nidhi",20),(106,"Ayushi",21),(107,"Anshuman",20)]
cur.executemany('Insert into Student values(?,?,?)',values)
db.commit()

In [6]:
# update age column
cur.execute('update student set Age = 22')

In [7]:
db.commit()

In [9]:
cur.execute('update student set Age = 21 where RollNo = 102')

In [11]:
db.commit()

In [13]:
new_age = 15
cur.execute('update student set Age = ? where RollNo = 102',(new_age,))

In [14]:
db.commit()

In [35]:
# fetch data

cur.execute('Select * from Student')

In [36]:
for row in cur:
    print(row)

(101, 'Aman', 22)
(102, 'Akash', 15)
(103, 'Abid', 22)
(104, 'Achyut', 22)
(105, 'Nidhi', 22)
(106, 'Ayushi', 22)
(107, 'Anshuman', 22)

In [40]:
# fetchone() || fetchmany() || fectchall()
cur.execute('Select * from Student')
# fetchone()
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())

# fetchmany()
print(cur.fetchmany(3))

# fectchall()
print(cur.fetchall())

(101, 'Aman', 22)
(102, 'Akash', 15)
(103, 'Abid', 22)
[(104, 'Achyut', 22), (105, 'Nidhi', 22), (106, 'Ayushi', 22)]
[(107, 'Anshuman', 22)]

### SQLite with Pandas

In [14]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

In [16]:
data = pd.read_sql_query('select * from student',db)
data

   RollNo      Name  Age
0     101      Aman   22
1     102     Akash   15
2     103      Abid   22
3     104    Achyut   22
4     105     Nidhi   22
5     106    Ayushi   22
6     107  Anshuman   22

In [20]:
data[data["Age"] == 15]

   RollNo   Name  Age
1     102  Akash   15

In [22]:
data = pd.DataFrame([[201,"Aman","English",20000],[202,"Nikita","Maths",25000],[203,"Rohan","Science",27000]],columns = ["ID","Name","Course","Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202  Nikita    Maths   25000
2  203   Rohan  Science   27000

In [24]:
data.to_sql("Faculty",db)

ValueError: Table 'Faculty' already exists.

In [27]:
data = pd.read_sql_query('select * from student',db)
data["Addres"] = "Test"
data

   RollNo      Name  Age Addres
0     101      Aman   22   Test
1     102     Akash   15   Test
2     103      Abid   22   Test
3     104    Achyut   22   Test
4     105     Nidhi   22   Test
5     106    Ayushi   22   Test
6     107  Anshuman   22   Test